docs/math/lie.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lie Groups and Algebras</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\DeclareMathOperator{\tr}{tr}
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
% For +---- metric
\newcommand{\BDpos}{}
\newcommand{\BDneg}{-}
\newcommand{\BDposs}{\phantom{-}}
\newcommand{\BDnegg}{-}
\newcommand{\BDplus}{+}
\newcommand{\BDminus}{-}
% For -+++ metric
\newcommand{\BDpos}{-}
\newcommand{\BDposs}{-}
\newcommand{\BDneg}{}
\newcommand{\BDnegg}{\phantom{-}}
\newcommand{\BDplus}{-}
\newcommand{\BDminus}{+}
\)</div>
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Lie Groups and Algebras</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-4d4928f6-e5fc-4af0-9fc1-7b4e3fae3304">1. Overview</a></li>
<li><a href="#h-45ec9c8d-f629-44f8-8990-899a032b54c1">2. References</a>
<ul>
<li><a href="#h-799d7e1b-d990-4af7-9e04-5d74ae4003d5">2.1. Triality</a></li>
<li><a href="#h-60755585-9f28-403e-97de-0e0e33cb1866">2.2. Particle Physics Related</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-h-4d4928f6-e5fc-4af0-9fc1-7b4e3fae3304" class="outline-2">
<h2 id="h-4d4928f6-e5fc-4af0-9fc1-7b4e3fae3304"><span class="section-number-2">1.</span> Overview</h2>
<div class="outline-text-2" id="text-h-4d4928f6-e5fc-4af0-9fc1-7b4e3fae3304">
<p>
Lie groups are groups which are manifolds, so in particular we could
consider a one-parameter smooth family of symmetries. But moreover, we
could consider any symmetry "arbitrarily close" to the identity
symmetry &#x2014; these look like \(I + \varepsilon X\), and the collection of
all such \(X\) guys form a Lie algebra. Intuitively, a "Lie algebra" is
just "infinitesimal symmetries" which are "near" the identity symmetry.
</p>

<p>
There are some famous families of Lie groups:
</p>

<ul class="org-ul">
<li>\(GL(n, \mathbb{F})\) the set of \(n\times n\) invertible matrices with
entries in the field \(\mathbb{F}\)</li>
<li>\(SL(n, \mathbb{F})\) the set of \(n\times n\) invertible matrices with
entries in the field \(\mathbb{F}\) <b>and</b> determinant 1</li>
<li>\(O(n, \mathbb{F})\) the set of \(n\times n\) <b>orthogonal</b> matrices with
entries in the field \(\mathbb{F}\)</li>
<li>\(SO(n, \mathbb{F})\) the set of \(n\times n\) <b>orthogonal</b> matrices with
entries in the field \(\mathbb{F}\) <b>and</b> determinant 1</li>
<li>\(U(n)\) the set of \(n\times n\) unitary matrices with complex entries</li>
<li>\(SU(n)\) the set of \(n\times n\) unitary matrices with determinant 1,
having complex entries.</li>
</ul>

<p>
We could also classify the "simple" Lie groups using Dynkin diagrams and
root systems:
</p>

<div class="remark" id="org72912c2">
<p>
I am lying here, the notion of a "simple Lie group" is ambiguous: no one
can agree on its definition. But there is a notion of a simple Lie
algebra, namely \(\mathfrak{g}\) is a simple Lie algebra if its adjoint
representation \(\mathrm{ad}\colon\mathfrak{g}\to\mathfrak{gl}(\mathfrak{g})\)
is irreducible (i.e., does not contain proper ideals). 
</p>

<p>
If we just take the connected Lie group corresponding to a simple Lie
algebra, then we may have discrete normal Subgroups&#x2026;which then does
not correspond to the notion of a "simple group".
</p>

</div>

<ul class="org-ul">
<li>\(A_{n} = SU(n+1)\)</li>
<li>\(B_{n}=SO(2n+1)\)</li>
<li>\(C_{n}=Sp(n)\)</li>
<li>\(D_{n}=SO(2n)\)</li>
<li>Exceptional simple Lie groups &#x2014; usually there are several Lie
groups corresponding to the same exceptional Lie algebra, but the
exceptions are:
<ul class="org-ul">
<li>\(E_{6}\)</li>
<li>\(E_{7}\)</li>
<li>\(E_{8}\) which can be obtained in a two-step shuffle (following
Adams's <i>Lectures on Exceptional Lie Groups</i>):
<ol class="org-ol">
<li>Construct the Lie algebra \(L=\mathfrak{spin}(16)+\Delta\) where
\(\Delta\) is the irrep for \(\mathfrak{spin}(16)\)</li>
<li>We have \(E_{8}=\mathrm{Aut}(L)\), possibly modulo some finite group.</li>
</ol></li>
<li>\(F_{4}\) which is the isometry group of the Octonionic projective
plane \(\mathbb{OP}^{2}\)</li>
<li>\(G_{2}\) which is the automorphism group of the Octonion algebra
(it's also the subgroup of \(SO(7)\) which preserves any chosen
particular vector in its 8-dimensional [real] spinor
representation); there are technically three groups identifiable as \(G_{2}\).</li>
</ul></li>
</ul>

<p>
The "two-step shuffle" used to construct the \(E_{8}\) group works for
other exceptional groups. The underlying mechanism may be justified
using Killing Spinors (see <a href="https://arxiv.org/abs/0706.2829">arXiv:0706.2829</a>).
</p>

<p>
The Dynkin diagrams then give us a way to encode the Cartan matrix
\(a_{ij}\), which is then used to construct the Lie algebra using the
Serre generators [= Chevalley basis = Cartan-Weyl basis] ("ladder operators" and other observables).
Consequently, Lie algebras play a critical role in quantum field theory.
</p>
</div>
</div>
<div id="outline-container-h-45ec9c8d-f629-44f8-8990-899a032b54c1" class="outline-2">
<h2 id="h-45ec9c8d-f629-44f8-8990-899a032b54c1"><span class="section-number-2">2.</span> References</h2>
<div class="outline-text-2" id="text-h-45ec9c8d-f629-44f8-8990-899a032b54c1">
<ul class="org-ul">
<li>C H Barton, A Sudbery,<br>
"Magic squares and matrix models of Lie algebras".<br>
<a href="https://arxiv.org/abs/math/0203010">arXiv:math/0203010</a>, 44 pages.</li>
<li>Fabio Bernardoni, Sergio L. Cacciatori, Bianca L. Cerchiai, Antonio Scotti,<br>
"Mapping the geometry of the F4 group".<br>
<a href="https://arxiv.org/abs/0705.3978">arXiv:0705.3978</a>, 50 pages.</li>
<li>Fabio Bernardoni, Sergio L. Cacciatori, Bianca L. Cerchiai, Antonio Scotti,<br>
"Mapping the geometry of the E6 group".<br>
<a href="https://arxiv.org/abs/0710.0356">arXiv:0710.0356</a>, 30 pages.</li>
<li>Sergio L. Cacciatori,<br>
"A simple parametrization for G2".<br>
<a href="https://arxiv.org/abs/math-ph/0503054">arXiv:math-ph/0503054</a>, 9 pages &#x2014; discusses \(G_{2}\) as an
\(SU(3)\) fibration</li>
<li>Sergio L. Cacciatori, Bianca L. Cerchiai, Alberto Della Vedova, Giovanni Ortenzi, Antonio Scotti,<br>
"Euler angles for G2".<br>
<a href="https://arxiv.org/abs/hep-th/0503106">arXiv:hep-th/0503106</a>, 21 pages.</li>
<li>Sergio L. Cacciatori, Francesco Dalla Piazza, Antonio Scotti,<br>
"E7 groups from octonionic magic square".<br>
<a href="https://arxiv.org/abs/1007.4758">arXiv:1007.4758</a>, 23 pages.</li>
<li>S. L. Cacciatori, F. Dalla Piazza, A. Scotti,<br>
"Compact Lie groups: Euler constructions and generalized Dyson conjecture".<br>
<a href="https://arxiv.org/abs/1207.1262">arXiv:1207.1262</a>, 11 pages.</li>
<li>S. L. Cacciatori, F. Dalla Piazza, A. Scotti,<br>
"A Simple E8 Construction".<br>
<a href="https://arxiv.org/abs/1207.3623">arXiv:1207.3623</a>, 3 pages.</li>
<li>Sergio L. Cacciatori, Bianca L. Cerchiai, Alessio Marrani,<br>
"Squaring the Magic".<br>
<a href="https://arxiv.org/abs/1208.6153">arXiv:1208.6153</a>, 21 pages.</li>
<li>José Figueroa-O'Farrill,<br>
"A geometric construction of the exceptional Lie algebras F4 and E8".<br>
<a href="https://arxiv.org/abs/0706.2829">arXiv:0706.2829</a>, 12 pages.</li>
<li>Merab Gogberashvili, Alexandre Gurchumelia,<br>
"Split Octonions and Triality in (4+4)-Space".<br>
<a href="https://arxiv.org/abs/2012.02255">arXiv:2012.02255</a>, 14 pages &#x2014; interesting for Spin(4, 4)</li>
<li>Kirill Krasnov,<br>
"Spin(11,3), particles and octonions".<br>
<a href="https://arxiv.org/abs/2104.01786">arXiv:2104.01786</a>, 27 pages.</li>
<li>David A. Richter,<br>
"Triacontagonal coordinates for the E(8) root system".<br>
<a href="https://arxiv.org/abs/0704.3091">arXiv:0704.3091</a>, 4 pages.</li>
<li>Ichiro Yokota,<br>
"Exceptional Lie groups".<br>
<a href="https://arxiv.org/abs/0902.0431">arXiv:0902.0431</a>, 204 pages.</li>
</ul>
</div>
<div id="outline-container-h-799d7e1b-d990-4af7-9e04-5d74ae4003d5" class="outline-3">
<h3 id="h-799d7e1b-d990-4af7-9e04-5d74ae4003d5"><span class="section-number-3">2.1.</span> Triality</h3>
<div class="outline-text-3" id="text-h-799d7e1b-d990-4af7-9e04-5d74ae4003d5">
<ul class="org-ul">
<li>Jonathan M. Evans,<br>
"Trialities and Exceptional Lie Algebras: DECONSTRUCTING the Magic Square".<br>
<a href="https://arxiv.org/abs/0910.1828">arXiv:0910.1828</a>, 34 pages.</li>
<li>Merab Gogberashvili, Alexandre Gurchumelia,<br>
"Split Octonions and Triality in (4+4)-Space".<br>
<a href="https://arxiv.org/abs/2012.02255">arXiv:2012.02255</a>, 14 pages &#x2014; interesting for Spin(4, 4)</li>
</ul>
</div>
</div>
<div id="outline-container-h-60755585-9f28-403e-97de-0e0e33cb1866" class="outline-3">
<h3 id="h-60755585-9f28-403e-97de-0e0e33cb1866"><span class="section-number-3">2.2.</span> Particle Physics Related</h3>
<div class="outline-text-3" id="text-h-60755585-9f28-403e-97de-0e0e33cb1866">
<ul class="org-ul">
<li>R. D. Peccei,<br>
"Discrete and Global Symmetries in Particle Physics".<br>
<a href="https://arxiv.org/abs/hep-ph/9807516">arXiv:hep-ph/9807516</a>, 50 pages.</li>
<li>Pierre Ramond,<br>
"Exceptional Groups and Physics".<br>
<a href="https://arxiv.org/abs/hep-th/0301050">arXiv:hep-th/0301050</a>, 9 pages.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated: Tue, 8 Aug 2023 07:32:46 -0700
</div>
</body>
</html>
